/* Примеры выражений

Любое выражение всегда возвращает значение

*/

'abc' /* Возвращает строку */

10 /* Возвращает число */

5 + 2 /* Возвращает результат */

c = 10 /* Возвращает значение переменной */

'Good' + 'Evening' /* Возвращает результат суммы строк */

a <= b || c !== d /* Вовзращает true или false */

myFunction(c, d)

/* Выражение присваивания 

в этом выражении приутствует оператор = 

*/

a = 20

/*                              Выражения с побочными действиями */
/* Это выражения которые не только возвращают значение но и выполняют другие действия */
b = 40 /* Выражение не только возвращает 40 но и присваивает значение переменной к которой можно будет обратится поздней */
b++ /*  Выражение которое не только возвращает новое значение но и увеличивает на 1 */
myFunction(
	a,
	b
) /* Не только возвращает значение но и выполняет другие действия внутри функции */
